* サイトの木構造

- https://github.com/masayuki054/meta-ruby/
- file://~suzuki/meta-ruby.git/


#+BEGIN_SRC sh :results output example :exports both
lstree ~/COMM/Lects/meta-ruby/git
#+END_SRC

#+RESULTS:
#+begin_example
/users/home/masayuki/COMM/Lects/meta-ruby/git@2017年 1月23日 月曜日 09時42分23秒 JST

+-README.md
+-docs-+-Figs-+-class-diagram-+-singleton.png
|      |      +-class_hier.png
|      |      +-object_and_class.png
|      +-emacs.html
|      +-index.html
|      +-lects.html
|      +-links.html
|      +-meta-ruby.html
|      +-note.html
|      +-oo.html
|      +-poker.html
|      +-ruby.html
|      +-styles-+-bigblow-+-css-+-bigblow.css
|               |         |     +-hideshow.css
|               |         |     +-htmlize.css
|               |         +-images-+-checked.png
|               |         |        +-fixme.png
|               |         |        +-halfchecked.png
|               |         |        +-info.png
|               |         |        +-note.png
|               |         |        +-tip.png
|               |         |        +-unchecked.png
|               |         |        +-warning.png
|               |         +-js-+-ZeroClipboard.swf
|               |              +-bigblow.js
|               |              +-hideshow.js
|               |              +-jquery-1.11.0.min.js
|               |              +-jquery-1.9.1.min.js
|               |              +-jquery-ui-1.10.2.min.js
|               |              +-jquery.localscroll-min.js
|               |              +-jquery.scrollTo-1.4.3.1-min.js
|               |              +-jquery.zclip.min.js
|               +-lib-+-js-+-jquery.stickytableheaders.min.js
|               |          +-stickytableheaders-license.txt
|               +-readtheorg-+-css-+-htmlize.css
|               |            |     +-readtheorg.css
|               |            |     +-rtd-full.css
|               |            +-js-+-readtheorg.js
|               |            +-readtheorg.org
|               +-sos-+-css-+-bigblow.css
|                     |     +-hideshow.css
|                     |     +-htmlize.css
|                     |     +-sos.css
|                     +-images-+-checked.png
|                     |        +-fixme.png
|                     |        +-halfchecked.png
|                     |        +-info.png
|                     |        +-note.png
|                     |        +-tip.png
|                     |        +-unchecked.png
|                     |        +-warning.png
|                     +-js-+-ZeroClipboard.swf
|                          +-bigblow.js
|                          +-hideshow.js
|                          +-readtheorg.js
|                          +-sos.js
|                          +-sos.js~
|                          +-sos.org
|                          +-tags
+-org-+-#index.org#
      +-Makefile
      +-Makefile.org
      +-Rakefile
      +-Rakefile.org
      +-Rakefile.setup.rb
      +-docs.org
      +-emacs-+-contents.org
      |       +-emacs-note.org
      |       +-emacs-setup.org
      |       +-org-note.org
      +-emacs.html
      +-emacs.org
      +-index.html
      +-index.html~
      +-index.org
      +-info-+-common-header.html
      |      +-common-header.org
      |      +-index-bigblow-header.setup
      |      +-index-readtheorg-header.setup
      |      +-index-sos-header.setup
      |      +-links.org
      |      +-org-link-make.org
      |      +-site-tree.org
      +-lects-+-01-+-01-GTD.org
      |       |    +-01-todo.org
      |       |    +-1.html
      |       |    +-1.org
      |       |    +-contents.org
      |       |    +-plan.org
      |       +-02-+-contents.org
      |       |    +-index.html
      |       |    +-index.org
      |       |    +-plan.org
      |       +-03-+-03-note.org
      |       |    +-Makefile
      |       |    +-contents.org
      |       |    +-index.html
      |       |    +-index.org
      |       |    +-plan.org
      |       |    +-response.org
      |       |    +-resume.org
      |       +-04-+-Makefile
      |       |    +-contents.org
      |       |    +-index.html
      |       |    +-index.org
      |       |    +-plan.org
      |       +-05-+-Makefile
      |       |    +-contents.org
      |       |    +-index.html
      |       |    +-index.org
      |       |    +-note.org
      |       |    +-plan.html
      |       |    +-plan.org
      |       |    +-resume.org
      |       |    +-working.org
      |       +-06-+-Makefile
      |       |    +-contents.org
      |       |    +-index.html
      |       |    +-index.org
      |       |    +-plan.html
      |       |    +-plan.org
      |       +-07-+-Makefile
      |       |    +-contents.org
      |       |    +-index.html
      |       |    +-index.org
      |       |    +-plan.html
      |       |    +-plan.org
      |       +-08-+-Makefile
      |       |    +-contents.org
      |       |    +-index.html
      |       |    +-index.org
      |       |    +-plan.html
      |       |    +-plan.org
      |       +-09-+-Makefile
      |       |    +-contents.org
      |       |    +-index.html
      |       |    +-index.org
      |       |    +-plan.html
      |       |    +-plan.org
      |       +-10-+-Makefile
      |       |    +-contents.org
      |       |    +-index.html
      |       |    +-index.org
      |       |    +-plan.html
      |       |    +-plan.org
      |       +-11-+-Makefile
      |       |    +-contents.org
      |       |    +-index.html
      |       |    +-index.org
      |       |    +-plan.html
      |       |    +-plan.org
      |       +-12-+-Makefile
      |       |    +-contents.org
      |       |    +-index.html
      |       |    +-index.org
      |       |    +-plan.html
      |       |    +-plan.org
      |       +-13-+-Makefile
      |       |    +-contents.org
      |       |    +-index.html
      |       |    +-index.org
      |       |    +-plan.html
      |       |    +-plan.org
      |       +-14-+-Makefile
      |       |    +-contents.org
      |       |    +-index.html
      |       |    +-index.org
      |       |    +-plan.html
      |       |    +-plan.org
      |       +-15-+-Makefile
      |       |    +-contents.org
      |       |    +-index.html
      |       |    +-index.org
      |       |    +-plan.html
      |       |    +-plan.org
      |       +-Makefile
      |       +-a.org
      |       +-announce.org
      |       +-contents.org
      |       +-index.html
      |       +-index.org
      |       +-meta-programming-ruby.org
      |       +-note.org
      |       +-openning.org
      |       +-org-links.org
      |       +-preface.org
      |       +-ri20min.rb
      |       +-ruby-begin.org
      |       +-ruby-note.org
      |       +-tohoho-ruby-1.org
      +-lects.html
      +-lects.org
      +-links.org
      +-log.org
      +-matz-+-Makefile
      |      +-index.html
      |      +-index.org
      |      +-matz-1-1.org
      |      +-matz-1-2.org
      |      +-matz-1-3.org
      |      +-matz-2.org
      |      +-matz-3.org
      |      +-matz-4.org
      |      +-matz-4.org.txt
      |      +-matz-6.org
      +-meta-ruby-+-Makefile
      |           +-babel-+-mymethod.rb
      |           +-block.org
      |           +-class.org
      |           +-contents.org
      |           +-index.html
      |           +-index.org
      |           +-intro.org
      |           +-methods.org
      |           +-object_model.org
      |           +-resume.org
      |           +-resume_meta_ruby.org
      |           +-resume_object_model.org
      +-meta-ruby.html
      +-meta-ruby.org
      +-note-+-Makefile
      |      +-babel-+-sqlite3-master-test.rb
      |      |       +-sqlite3-master.rb
      |      |       +-test-+-test_sample.rb
      |      +-class_hier.graffle
      |      +-class_hier.png
      |      +-contents.org
      |      +-index.html
      |      +-index.org
      |      +-memo.org
      |      +-org-doc-+-notes-+-readme.html
      |      |         |       +-readme.org
      |      |         +-org-+-run.org
      |      |         +-readme.org
      |      |         +-run-+-0
      |      |         |     +-1
      |      |         +-src-+-Gemfile
      |      |               +-app.rb
      |      |               +-config.ru
      |      +-poker.org
      |      +-ruby-begin-note.org
      |      +-ruby-life.org
      |      +-ruby-note-begin.org
      |      +-ruby-note-meta-block.org
      |      +-ruby-note-refe.org
      |      +-ruby-note-sinatra-org.org
      |      +-ruby-note-sqlite.org
      |      +-ruby-note-string.org
      |      +-ruby-note-test.org
      |      +-ruby-note.html
      |      +-ruby-note.org
      |      +-sinatra-org-+-org-+-original-run.org
      |                    |     +-run.org
      |                    +-readme.org
      |                    +-run-+-0
      |                    |     +-1
      |                    +-src-+-Gemfile
      |                          +-Gemfile.lock
      |                          +-app.rb
      |                          +-config.ru
      |                          +-ruby-note-meta.html
      |                          +-ruby-note.html
      +-note.html
      +-note.html~
      +-note.org
      +-oo-+-contents.org
      |    +-index.html
      |    +-index.org
      |    +-oo-note-oo-sucks.org
      |    +-oo-principle.org
      |    +-strategic-choice.org
      |    +-to_oo.org
      |    +-to_oo_note.org
      +-oo.html
      +-oo.html~
      +-oo.org
      +-org-docs-+-Makefile
      |          +-Makefile.org
      |          +-contents.org
      |          +-index.html
      |          +-index.org
      +-poker-+-Rakefile.org
      |       +-babel-+-Rakefile
      |       |       +-poker.rb
      |       |       +-src-+-card.rb
      |       |       |     +-constant.rb
      |       |       |     +-deck.rb
      |       |       |     +-hand.rb
      |       |       |     +-player.rb
      |       |       +-test-+-test-card.rb
      |       |              +-test-constant.rb
      |       |              +-test-deck.rb
      |       |              +-test-hand.rb
      |       |              +-test-player.rb
      |       +-card.org
      |       +-constant.org
      |       +-deck.org
      |       +-hand.org
      |       +-index.html
      |       +-index.org
      |       +-old_src-+-*shell*
      |       |         +-Rakefile
      |       |         +-Rakefile.org
      |       |         +-card.rb
      |       |         +-card.rb.org
      |       |         +-constant.rb
      |       |         +-constant.rb.org
      |       |         +-deck.rb
      |       |         +-deck.rb.org
      |       |         +-hand.rb
      |       |         +-hand.rb.org
      |       |         +-play.rb
      |       |         +-player.rb
      |       |         +-player.rb.org
      |       |         +-poker.rb
      |       |         +-poker.rb.org
      |       |         +-test-card.rb
      |       |         +-test-card.rb.org
      |       |         +-test-constant.rb
      |       |         +-test-constant.rb.org
      |       |         +-test-deck.rb
      |       |         +-test-deck.rb.org
      |       |         +-test-hand.rb
      |       |         +-test-poker.rb
      |       +-org-test.org
      |       +-player.org
      |       +-poker.html
      |       +-poker.org
      +-poker.html
      +-poker.org
      +-ruby-+-contents.org
      |      +-pry.org
      |      +-ruby.org
      +-ruby.html
      +-ruby.org
      +-touch
      +-work-+-abstract_factory-+-animal.rb
             |                  +-animals-+-duck.rb
             |                  |         +-frog.rb
             |                  +-do_duck_and_waterlily_factory.rb
             |                  +-do_frog_and_algae_factory.rb
             |                  +-duck_and_frog.rb
             |                  +-organism_factories-+-#frog_and_algae.rb#
             |                  |                    +-duck_and_waterlily.rb
             |                  |                    +-frog_and_algae.rb
             |                  +-organism_factory.rb
             |                  +-plant.rb
             |                  +-plants-+-algae.rb
             |                  |        +-waterlily.rb
             |                  +-waterlily_and_algae.rb
             +-babel-+-meta-class-hierarchy.rb
             +-block.org
             +-builder-pattern-+-builder.rb
             |                 +-builders-+-saltwater.rb
             |                 |          +-sugarwater.rb
             |                 +-director.rb
             |                 +-test_builder-pattern.rb
             +-builder-pattern.org
             +-class-diagram-+-material-water-builder.png
             |               +-singleton.png
             |               +-sugar-water-builder.png
             +-design-pattern.org
             +-doc-+-_index.html
             |     +-class_list.html
             |     +-css-+-common.css
             |     |     +-full_list.css
             |     |     +-style.css
             |     +-file_list.html
             |     +-frames.html
             |     +-index.html
             |     +-js-+-app.js
             |     |    +-full_list.js
             |     |    +-jquery.js
             |     +-method_list.html
             |     +-top-level-namespace.html
             +-examples-+-dir_print.rb
             |          +-file_print.rb
             |          +-home_directory.rb
             |          +-shuzo_meigen.rb
             +-examples.org
             +-meta-programming-ruby.org
             +-singleton-+-singleton.rb
             +-uml.org
#+end_example

